#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
time_static.current: Refreshing state... [id=2025-02-11T20:16:33Z]
random_id.id_flow: Refreshing state... [id=ufv5w2ozwO8]
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=78034a915ae7e28245eef0578a8e8008174bc44c2af78c9ba4a469a398498927]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=qQ9YUoT6nBQ]
module.ubunturoutervm.random_id.randomid_pip[0]: Refreshing state... [id=N4jWfw]
random_string.encryption_compute: Refreshing state... [id=9cflvs]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=1084986733]
data.azuread_client_config.this: Reading...
data.azuread_client_config.this: Read complete after 0s [id=400ebb99-99e3-4a2a-af83-b2b5edff74fa-18a2dc63-b93f-42f1-b9d6-f4fe7d8c2b4e-2035781a-45a2-4065-ab81-e1b924cd8eae]
data.azurerm_key_vault.secrets: Reading...
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
azurerm_user_assigned_identity.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uai-compute-9cflvs]
azurerm_key_vault.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
azurerm_network_watcher.networkwatcher_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001]
azurerm_network_security_group.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
azurerm_storage_account.flow: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Storage/storageAccounts/stflowb9fbf9c36a33c0ef]
azurerm_log_analytics_workspace.law_platform: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.OperationalInsights/workspaces/law-platform]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
data.azurerm_key_vault.secrets: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
data.azurerm_key_vault_secret.vmpassword: Reading...
module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Reading...
azurerm_subnet.hub_subnet["RouterSubnet"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
module.spoke1network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
azurerm_subnet_network_security_group_association.nsg_router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
module.spoke2network.azurerm_network_security_group.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-DatabaseTier]
data.azurerm_key_vault_secret.vmpassword: Read complete after 1s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]
module.spoke2network.azurerm_network_security_group.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-LogicTier]
module.spoke2network.azurerm_network_security_group.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/networkSecurityGroups/nsg-WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-a90f585284fa9c14]
azurerm_role_assignment.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs/providers/Microsoft.Authorization/roleAssignments/2217cfbb-24c6-f7e2-fe53-b9e938ac49f0]
azurerm_key_vault_key.encryption_compute: Refreshing state... [id=https://kv-compute-9cflvs.vault.azure.net/keys/cmk-compute-20250211-2016/2e07b4106f6b4668a54e21c232b10274]
azurerm_monitor_diagnostic_setting.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router|nsg_router_diag]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
azurerm_disk_encryption_set.encryption_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/diskEncryptionSets/des-compute-9cflvs]
module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
azurerm_network_watcher_flow_log.spoke2: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke2flow]
azurerm_network_watcher_flow_log.spoke1: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke1-flow]
azurerm_network_watcher_flow_log.hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/hub-flow]
azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001/extensions/vm-hub-dev-001-networkwatcher]
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=6Z5NKFxmZaQ]
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=RHBx4BeBJoU]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4]
module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001]
module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001]
azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-hub-dev-001-ubuntucom]
azurerm_virtual_machine_extension.spoke1vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher]
azurerm_virtual_machine_extension.spoke2vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher]
azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom]
azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke1vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom"
        name                          = "vm-spoke1-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke1-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke1-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom will be updated in-place
  ~ resource "azurerm_network_connection_monitor" "spoke2vm_monitor_ubuntucom" {
        id                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom"
        name                          = "vm-spoke2-dev-001-ubuntucom"
        tags                          = {
            "environment" = "Dev"
        }
        # (4 unchanged attributes hidden)

      - endpoint {
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "vm-spoke2-dev-001" -> null
          - target_resource_id    = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> null
            # (3 unchanged attributes hidden)
        }
      - endpoint {
          - address               = "archive.ubuntu.com" -> null
          - excluded_ip_addresses = [] -> null
          - included_ip_addresses = [] -> null
          - name                  = "archive.ubuntu.com" -> null
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "vm-spoke2-dev-001"
          + target_resource_id    = (known after apply)
            # (3 unchanged attributes hidden)
        }
      + endpoint {
          + address               = "archive.ubuntu.com"
          + excluded_ip_addresses = []
          + included_ip_addresses = []
          + name                  = "archive.ubuntu.com"
        }

        # (2 unchanged blocks hidden)
    }

  # azurerm_role_assignment.encryption_compute_extended will be created
  + resource "azurerm_role_assignment" "encryption_compute_extended" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5ad3ce98-9ce5-44d4-8006-49b302d0ce80"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Crypto Service Encryption User"
      + scope                            = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.KeyVault/vaults/kv-compute-9cflvs"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_virtual_machine_extension.spoke1vm_networkwatcher must be replaced
-/+ resource "azurerm_virtual_machine_extension" "spoke1vm_networkwatcher" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher" -> (known after apply)
        name                        = "vm-spoke1-dev-001-networkwatcher"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # azurerm_virtual_machine_extension.spoke2vm_networkwatcher must be replaced
-/+ resource "azurerm_virtual_machine_extension" "spoke2vm_networkwatcher" {
      - automatic_upgrade_enabled   = false -> null
      ~ id                          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher" -> (known after apply)
        name                        = "vm-spoke2-dev-001-networkwatcher"
      - provision_after_extensions  = [] -> null
        tags                        = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id          = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ubuntuspoke1.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke1.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "spokevm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001" -> (known after apply)
        name                                                   = "vm-spoke1-dev-001"
      ~ private_ip_address                                     = "10.100.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.100.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id                                     = "7c769515-29e2-447a-a65d-7f7723119cff" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (31 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ id                               = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/disks/vm-spoke1-dev-001_OsDisk_1_c23bbc422f9b48cd9d5e55ced31266f9" -> (known after apply)
          ~ name                             = "vm-spoke1-dev-001_OsDisk_1_c23bbc422f9b48cd9d5e55ced31266f9" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (1 unchanged block hidden)
    }

  # module.ubuntuspoke2.data.template_cloudinit_config.config_linux will be read during apply
  # (config refers to values not yet known)
 <= data "template_cloudinit_config" "config_linux" {
      + base64_encode = true
      + gzip          = true
      + id            = (known after apply)
      + rendered      = (known after apply)

      + part {
          + content      = (known after apply)
          + content_type = "text/cloud-config"
        }
    }

  # module.ubuntuspoke2.data.template_file.cloudconfig_linux will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "cloudconfig_linux" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = <<-EOT
            #cloud-config
            package_upgrade: true
            packages:
              - traceroute
            ntp:
              pools: ['0.de.pool.ntp.org', '1.de.pool.ntp.org', '2.de.pool.ntp.org', '3.de.pool.ntp.org']
        EOT
    }

  # module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm must be replaced
-/+ resource "azurerm_linux_virtual_machine" "spokevm" {
      ~ custom_data                                            = (sensitive value) # forces replacement
      + disk_controller_type                                   = (known after apply)
      - encryption_at_host_enabled                             = false -> null
      ~ id                                                     = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001" -> (known after apply)
        name                                                   = "vm-spoke2-dev-001"
      ~ private_ip_address                                     = "10.101.1.4" -> (known after apply)
      ~ private_ip_addresses                                   = [
          - "10.101.1.4",
        ] -> (known after apply)
      + public_ip_address                                      = (known after apply)
      ~ public_ip_addresses                                    = [] -> (known after apply)
      - secure_boot_enabled                                    = false -> null
        tags                                                   = {
            "environment" = "Dev"
        }
      ~ virtual_machine_id                                     = "cdcbd706-74a2-4a6f-a26e-65f9af32ed93" -> (known after apply)
      - vtpm_enabled                                           = false -> null
        # (31 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb                     = 30 -> (known after apply)
          ~ id                               = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/disks/vm-spoke2-dev-001_OsDisk_1_df92c9e397cc4f54b7296986703dd4f7" -> (known after apply)
          ~ name                             = "vm-spoke2-dev-001_OsDisk_1_df92c9e397cc4f54b7296986703dd4f7" -> (known after apply)
            # (6 unchanged attributes hidden)
        }

      ~ termination_notification (known after apply)

        # (1 unchanged block hidden)
    }

Plan: 5 to add, 2 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*